[
  {
    "": 0,
    "course": "MS7110",
    "course_name": "History of Materials",
    "course_summary": "The aim of this course is to provide a historical perspective and introduce central concepts in the selection, design, and testing of materials that will underpin the Master program.\n\nAt the end of this course the students will be able to:\n\n• Understand the range and uses of materials from the past to the current day.\n\n• Appreciate past contributions to present-day materials science and trace its development.\n\n• Develop a foundational understanding of Materials Science and Materials Engineering.\n\n• Develop an understanding of the potentials and limitations of materials.\n\nPre-requisites: None",
    "course_url": "https://www.ntu.edu.sg/docs/librariesprovider121/mse-postgraduates/mse-pg-coursesummary/ms7110.pdf?sfvrsn=7f906a9b_11",
    "course_description": "MS7110: History of Materials, coordinated by Asst Prof Tan Kwan Wee, is a dynamic course blending historical insights with modern material sciences. It focuses on the evolution of materials from the Stone Age to present-day innovations, emphasizing their impact on technology, art, and construction. The course uniquely integrates a scientific understanding of materials' properties, spanning polymers, metals, ceramics, and composites.\nKey characteristics include:\nHistorical Perspective: Tracing materials' development through various ages, contextualized with modern scientific knowledge.\nComprehensive Content: Covering various material systems and their applications, limitations, and potentials.\nPractical and Theoretical Blend: Through case studies, students apply theoretical knowledge to real-world scenarios.\nDiverse Teaching Methods: Including lectures, videos, tutorials, and peer discussions.\nAssessment is based on two major case studies. Supplementary readings support the coursework. The course, part of the Master's program, is designed to build foundational knowledge in Materials Science and Engineering, emphasizing both historical context and future potentials.",
    "relevance": 4.3,
    "difficulty": 2.9225,
    "# of semesters": "4",
    "Theme 1": "Materials Fundamentals",
    "Theme 2": "",
    "Theme 3": "",
    "Keywords": "materials history, interdisciplinary, innovation",
    "top_topic_1": "interdisciplinary",
    "top_topic_2": "material properties",
    "top_topic_3": "materials history",
    "top_topic_1_contribution": 0.9873,
    "top_topic_2_contribution": 0.9866,
    "top_topic_3_contribution": 0.9841
  },
  {
    "": 1,
    "course": "MS7120",
    "course_name": "Inorganic Materials",
    "course_summary": "The aim is to equip students to critically assess inorganic compounds, predict their properties based on chemistry, and design new materials with specific properties.\n\nAt the end of this course the students will be able to:\n\n• Compare and correlate electromagnetic emissions with atomic structure.\n\n• Explain how polarization, electron affinity, and valency determine the relative contribution to bonding characteristics.\n\n• Describe the characteristics and reactivity of common non-metals and metals.\n\n• List and analyze non-metal and metal technologies in the engineering industry, such as thermoelectric, superhard, and chalcogenide materials.\n\nPre-requisites: None",
    "course_url": "https://www.ntu.edu.sg/docs/librariesprovider121/mse-postgraduates/mse-pg-coursesummary/ms7120.pdf?sfvrsn=2bde3071_14",
    "course_description": "MS7120: Inorganic Materials is a distinctive course, led by Dr. Feng Xiaolei, designed to provide a comprehensive understanding of descriptive inorganic chemistry for effective technological material design.\nKey characteristics include:\nAccessibility and Balance: Tailored for diverse scientific and engineering backgrounds, ensuring a thorough and understandable treatment of inorganic chemistry.\nPractical Focus: Systematically explores reactivity, stability, and properties of inorganic compounds, with direct applications to crucial industrial materials.\nPractical Skill Development: Equips students to critically assess inorganic compounds, predict properties, and design materials with specific characteristics.\nAssessment Rigor: Evaluation through two Continuous Assessments (80% MCQ, 20% Essay) covering modules 1 to 3, ensuring a robust understanding of the subject.\nEngaging Teaching Methods: Utilizes a variety of approaches, including lectures, MCQ assessments, tutorials, and peer discussions, enhancing student engagement and understanding.\nEssential Reading: Incorporates key works by Tilley and Shriver, focusing on crystals, crystal structures, and ceramic materials.\nThis course, spanning 39 hours and equivalent to 3 Academic Units, delves into fundamental principles, non-metallic materials (halogens, oxygen group, nitrogen group, carbon, silicon, boron, chalcogenide materials, superhard materials), and metallic materials (alkaline and alkaline earth metals, aluminium, gallium, indium, transition metals, rare earth metals, lanthanide oxide glasses, iron, steel, special steel grades).",
    "relevance": 4.4372,
    "difficulty": 2.9314,
    "# of semesters": "5",
    "Theme 1": "Materials Fundamentals",
    "Theme 2": "Industrial materials",
    "Theme 3": "",
    "keywords": "inorganic chemistry, crystals, material design",
    "top_topic_1": "interdisciplinary",
    "top_topic_2": "industrial applications",
    "top_topic_3": "inorganic materials",
    "top_topic_1_contribution": 0.9907,
    "top_topic_2_contribution": 0.9811,
    "top_topic_3_contribution": 0.9766
  },
  {
    "": 2,
    "course": "MS7130",
    "course_name": "Organic Materials",
    "course_summary": "The aim of this course is to equip students to critically assess inorganic compounds, predict their properties based on chemistry, and design new materials with specific properties.\n\nAt the end of this course the students will be able to:\n\n• Compare and correlate electromagnetic emissions with atomic structure.\n\n• Explain how polarization, electron affinity, and valency determine the relative contribution to bonding characteristics.\n\n• Describe the characteristics and reactivity of common non-metals and metals.\n\n• List and analyze non-metal and metal technologies in the engineering industry, such as thermoelectric, superhard, and chalcogenide materials.\n\nPre-requisites: None",
    "course_url": "https://www.ntu.edu.sg/docs/librariesprovider121/mse-postgraduates/mse-pg-coursesummary/ms7130.pdf?sfvrsn=ab3efe65_12",
    "course_description": "MS7130: Organic Materials is an advanced course, led by Assoc Prof Andrew Grimsdale, delving into the world of organic materials with a focus on functional applications.\nKey characteristics include:\nWide Scope of Coverage: Encompassing bulk commodities, bio-inspired materials, cutting-edge substances like graphene, and organic colorants and semiconductors, highlighting their roles in various applications such as biosensors, LED displays, and organic solar cells.\nMaterials Approach: Adopting a processing-structure-property-performance framework to comprehensively address the structural, optical, and electronic aspects of organic materials.\nPractical Learning Objectives: Equipping students to understand, critically analyze, and predict the future directions of organic materials for modern technological applications.\nAssessment Rigor: The evaluation includes 3 tutorials (30%), CA1 and CA2 with MCQs (25% each), and a research paper critique through peer review (20%).\nEngaging Teaching Methods: Incorporating a mix of lectures, tutorials, and peer discussions to enhance student learning and understanding.\nExpert Instruction: Led by Assoc Prof Andrew Grimsdale, a seasoned expert in the field, ensuring students receive quality instruction.\nIn-Depth Syllabus: Covering fundamental principles, structural organic materials, electronic and optical properties of organic materials, and analytical techniques.\nPractical Analysis: Including the study of size exclusion chromatography, thermal methods, spectroscopy, microscopy, X-ray diffraction, and electrical characterization techniques.\nThis 39-hour course, equivalent to 3 Academic Units, is scheduled for Semester 1, AY2021-22, and does not have any course duplications.",
    "relevance": 4.0578,
    "difficulty": 3.5168,
    "# of semesters": "5",
    "Theme 1": "Materials Fundamentals",
    "Theme 2": "",
    "Theme 3": "",
    "keywords": "organic materials, functional applications, structural analysis",
    "top_topic_1": "functional applications",
    "top_topic_2": "organic materials",
    "top_topic_3": "interdisciplinary",
    "top_topic_1_contribution": 0.9955,
    "top_topic_2_contribution": 0.9946,
    "top_topic_3_contribution": 0.9765
  },
  {
    "": 3,
    "course": "MS7140",
    "course_name": "Properties of Materials",
    "course_summary": "The aim of this course is to introduce central concepts in the properties of materials that will underpin the program. This will form a solid platform for engineers to launch into higher-level courses that utilize material properties in designing structures, devices, and systems.\n\nAt the end of this course the students will be able to:\n\n• Choose standard experiments to measure specific properties.\n\n• Recommend materials for specific applications.\n\n• Explain the reasons for a material to exhibit certain properties and suggest methodology to improve them.\n\nPre-requisites: None",
    "course_url": "https://www.ntu.edu.sg/docs/librariesprovider121/mse-postgraduates/mse-pg-coursesummary/ms7140.pdf?sfvrsn=efa45631_14",
    "course_description": "MS7140: Properties of Materials, led by Thirumany Sritharan, is an intensive course focusing on the key properties of materials - mechanical, thermal, optical, magnetic, and electrical. It covers:\nMechanical Properties: Stress and strain behaviors, hardness, and fracture mechanics.\nOptical Properties: Light-material interactions including refraction and absorption.\nMagnetic Properties: Magnetic moments and phenomena like ferromagnetism.\nElectrical Properties: Electron band structures, conductivity, and piezoelectricity.\nThe course aims to provide a solid foundation in material properties, crucial for designing advanced engineering systems. Students will learn to measure and recommend materials for specific applications, and understand the underlying reasons for their properties.\nAssessment: A mix of individual and group tasks including tests, essays, and learning logs.\nMethodology: Lectures, interviews, and peer discussions.\nSyllabus Highlights:\nMechanical and thermal properties: From elasticity to thermal stress.\nOptical, magnetic, and electrical properties: Understanding photon absorption to superconductivity.\nKey Readings: Materials Science and Engineering by Callister, and supplementary texts by Hertzberg and Livingston.\nThis course is essential for engineers and scientists aiming to apply material properties in real-world scenarios.",
    "relevance": 4.25,
    "difficulty": 3.183,
    "# of semesters": "6",
    "Theme 1": "Characterisation",
    "Theme 2": "Materials Fundamentals",
    "Theme 3": "Industrial materials",
    "keywords": "mechanical behavior, material properties, optical properties, electrical properties",
    "top_topic_1": "interdisciplinary",
    "top_topic_2": "material properties",
    "top_topic_3": "material evaluation",
    "top_topic_1_contribution": 0.9942,
    "top_topic_2_contribution": 0.9665,
    "top_topic_3_contribution": 0.9487
  },
  {
    "": 4,
    "course": "MS7210",
    "course_name": "Processing of Inorganic Materials",
    "course_summary": "The aim of this course is to provide students with a basic understanding of manufacturing processes, and the relationships between process design and fundamental concepts in transport phenomena, and properties.\n\nAt the end of this course the students will be able to:\n\n• Explain the relationships between basic concepts and the design of the processing route.\n\n• Apply basic concepts to predict material behavior during processing.\n\n• Predict the structure and properties of the end products.\n\n• List the advantages and limitations of each process.\n\n• Choose the best process for a particular component, device, or material.\n\nPre-requisites: None",
    "course_url": "https://www.ntu.edu.sg/docs/librariesprovider121/mse-postgraduates/mse-pg-coursesummary/ms7210.pdf?sfvrsn=f8a495fc_9",
    "course_description": "MS7210: Processing of Inorganic Materials, taught by Dr. Long Yi, is a specialized course designed to deepen understanding of material processing techniques. It bridges the gap between materials science, mechanical engineering, chemistry, and economics. The course focuses on automated and computer-controlled equipment in commercial processing, emphasizing the underlying scientific principles.\nAims and Objectives:\n1. Understand the design and basic concepts of processing routes.\n2. Predict material behavior during processing.\n3. Determine the structure and properties of end products.\n4. Assess the advantages and limitations of each process.\n5. Select the best processing method for specific components or materials.\nCourse Syllabus:\nModule 1: Processes for particulate and bulk materials.\nModule 2: Vacuum processes.\nModule 3: Solution processes.\nAssessment: Includes continuous assessment, oral presentations, and review papers, contributing to a total of 100%.\nMethodology: Lectures, multiple-choice questions, tutorials, and problem-based learning.\nReadings:\nKey texts by Ohring, Smith, Mitzi, and Barsoum.\nThe course, beginning in AY 2018/19 Semester 2, is aimed at students seeking a comprehensive understanding of inorganic material processing, relevant for various engineering applications.",
    "relevance": 4.2735,
    "difficulty": 3.2958,
    "# of semesters": "4",
    "Theme 1": "Materials Fundamentals",
    "Theme 2": "Industrial materials",
    "Theme 3": "",
    "keywords": "material processing, automated equipment, scientific principles",
    "top_topic_1": "interdisciplinary",
    "top_topic_2": "material processing",
    "top_topic_3": "industrial applications",
    "top_topic_1_contribution": 0.9942,
    "top_topic_2_contribution": 0.9665,
    "top_topic_3_contribution": 0.9487
  },
  {
    "": 5,
    "course": "MS7220",
    "course_name": "Polymer Science and Engineering",
    "course_summary": "The aim of this course is to provide students with a comprehensive understanding of polymer materials and their applications.\n\nAt the end of this course the students will be able to:\n\n• Describe intrinsic properties and how they are determined by polymer composition. Explain Van Krevelen's Additive Molar Function model and apply it for a range of properties.\n\n• Design and assess product properties in terms of their mechanical properties and physical performance.\n\n• Describe how processing parameters and conditions generate specific structures and morphologies, which in turn determine properties.\n\n• Explain the fundamental aspects of polymer properties, viz., phase transitions, viscoelasticity, stress-strain behavior, which are manifested in product properties.\n\n• Describe the basic industrial polymer processing technologies, including those of composite materials.\n\n• Describe emerging materials and technologies including nanocomposites, biomimetics, 3D printing, and electrospinning.\n\nPre-requisites: None",
    "course_url": "https://www.ntu.edu.sg/docs/librariesprovider121/mse-postgraduates/mse-pg-coursesummary/ms7220.pdf?sfvrsn=example",
    "course_description": "MS7220: Polymer Science and Engineering is an advanced course covering the fundamental principles and applications of polymer materials. The course explores polymer chemistry, physics, and engineering aspects with a focus on modern applications.\nKey characteristics include:\nComprehensive Coverage: From basic polymer chemistry to advanced processing techniques.\nPractical Applications: Real-world examples from industry and research.\nModern Technologies: Including nanocomposites, biomimetics, and 3D printing.\nAssessment: Continuous assessment through assignments and final examination.\nMethodology: Lectures, laboratory sessions, and project work.",
    "relevance": 4.5,
    "difficulty": 3.8,
    "# of semesters": "5",
    "Theme 1": "Polymers",
    "Theme 2": "Materials Fundamentals",
    "Theme 3": "",
    "keywords": "polymer science, polymer engineering, nanocomposites, 3D printing",
    "top_topic_1": "polymer properties",
    "top_topic_2": "polymer processing",
    "top_topic_3": "modern applications",
    "top_topic_1_contribution": 0.9950,
    "top_topic_2_contribution": 0.9940,
    "top_topic_3_contribution": 0.9930
  },
  {
    "": 6,
    "course": "MS7230",
    "course_name": "Computational Materials Science",
    "course_summary": "The aim of this course is to introduce computational methods for materials science applications.\n\nAt the end of this course the students will be able to:\n\n• Explain the different techniques of computational modeling of materials.\n\n• Differentiate between the usage of Finite Element Method, Molecular Dynamics simulations, and ab-initio quantum mechanical modeling.\n\n• Appreciate the utility of computational modeling as an aid to uncover the underlying physics of experimental studies.\n\nPre-requisites: None",
    "course_url": "https://www.ntu.edu.sg/docs/librariesprovider121/mse-postgraduates/mse-pg-coursesummary/ms7230.pdf?sfvrsn=example",
    "course_description": "MS7230: Computational Materials Science provides students with hands-on experience in computational modeling techniques for materials science. The course covers various simulation methods and their applications.\nKey characteristics include:\nPractical Simulations: Hands-on experience with computational tools.\nMultiple Methods: FEM, Molecular Dynamics, and quantum mechanical approaches.\nIndustry Applications: Real-world examples from materials research and development.\nAssessment: Project-based assessment with computational assignments.\nMethodology: Lectures, computer laboratory sessions, and project work.",
    "relevance": 4.2,
    "difficulty": 4.0,
    "# of semesters": "4",
    "Theme 1": "Modelling",
    "Theme 2": "Materials Fundamentals",
    "Theme 3": "",
    "keywords": "computational modeling, finite element method, molecular dynamics, simulations",
    "top_topic_1": "computational methods",
    "top_topic_2": "simulation techniques",
    "top_topic_3": "materials modeling",
    "top_topic_1_contribution": 0.9940,
    "top_topic_2_contribution": 0.9930,
    "top_topic_3_contribution": 0.9920
  },
  {
    "": 7,
    "course": "MS7240",
    "course_name": "Advanced Characterization Techniques",
    "course_summary": "The aim of this course is to provide comprehensive knowledge of advanced materials characterization methods.\n\nAt the end of this course the students will be able to:\n\n• Describe the working principles of IR, UV-VIS, XRF, and XPS.\n\n• Analyze data acquired from each of the spectroscopic techniques.\n\n• Recommend suitable techniques for evaluating material properties with clear justifications.\n\n• Integrate information from multiple datasets to make deductions about material properties.\n\nPre-requisites: None",
    "course_url": "https://www.ntu.edu.sg/docs/librariesprovider121/mse-postgraduates/mse-pg-coursesummary/ms7240.pdf?sfvrsn=example",
    "course_description": "MS7240: Advanced Characterization Techniques covers modern analytical methods for materials analysis. Students learn to use sophisticated instruments and interpret complex data.\nKey characteristics include:\nModern Techniques: Latest characterization methods and instruments.\nData Analysis: Comprehensive training in data interpretation.\nPractical Experience: Hands-on experience with analytical equipment.\nAssessment: Laboratory reports and final examination.\nMethodology: Lectures, laboratory sessions, and data analysis workshops.",
    "relevance": 4.6,
    "difficulty": 3.5,
    "# of semesters": "5",
    "Theme 1": "Characterisation",
    "Theme 2": "Materials Fundamentals",
    "Theme 3": "",
    "keywords": "characterization techniques, spectroscopy, data analysis, materials analysis",
    "top_topic_1": "analytical techniques",
    "top_topic_2": "data interpretation",
    "top_topic_3": "instrumentation",
    "top_topic_1_contribution": 0.9950,
    "top_topic_2_contribution": 0.9940,
    "top_topic_3_contribution": 0.9930
  },
  {
    "": 8,
    "course": "MS7250",
    "course_name": "Thermal and Surface Analysis",
    "course_summary": "The aim of this course is to provide specialized knowledge in thermal and surface analysis techniques.\n\nAt the end of this course, the students will:\n\n• Select and evaluate physical characterization techniques, namely thermal and surface analysis, for the investigation of material performance.\n\n• Develop laboratory facilities for thermal and surface analysis.\n\nPre-requisites: None",
    "course_url": "https://www.ntu.edu.sg/docs/librariesprovider121/mse-postgraduates/mse-pg-coursesummary/ms7250.pdf?sfvrsn=example",
    "course_description": "MS7250: Thermal and Surface Analysis focuses on specialized techniques for analyzing material surfaces and thermal properties. The course provides practical experience with advanced analytical instruments.\nKey characteristics include:\nSpecialized Techniques: Focus on thermal and surface analysis methods.\nLaboratory Development: Training in setting up analytical facilities.\nPractical Applications: Real-world applications in materials research.\nAssessment: Laboratory projects and facility development reports.\nMethodology: Lectures, laboratory work, and facility design projects.",
    "relevance": 4.1,
    "difficulty": 3.7,
    "# of semesters": "4",
    "Theme 1": "Characterisation",
    "Theme 2": "Materials Fundamentals",
    "Theme 3": "",
    "keywords": "thermal analysis, surface analysis, laboratory development, materials characterization",
    "top_topic_1": "thermal techniques",
    "top_topic_2": "surface analysis",
    "top_topic_3": "laboratory setup",
    "top_topic_1_contribution": 0.9940,
    "top_topic_2_contribution": 0.9930,
    "top_topic_3_contribution": 0.9920
  },
  {
    "": 9,
    "course": "MS7260",
    "course_name": "Crystal Chemistry and Structure",
    "course_summary": "The aim of this course is to provide comprehensive understanding of crystal structures and their chemical properties.\n\nAt the end of this course the students will:\n\n• Find crystal structure databases accessible and be able to interpret Crystallographic Information Files (CIFs).\n\n• Understand orderly variations in atomic and ionic radii and exploit these systematics to design materials.\n\n• Know the characteristics and crystal chemical diversity of simple crystal structure families.\n\n• Predict the changes in crystal structures when perturbed by changes in temperature, pressure, and chemistry.\n\n• Recognize the types of nonstoichiometric adaptations and the mechanism for incorporating these in crystal structures.\n\n• Critically read authentic texts and attend research seminars describing nonstoichiometric functional materials.\n\nPre-requisites: None",
    "course_url": "https://www.ntu.edu.sg/docs/librariesprovider121/mse-postgraduates/mse-pg-coursesummary/ms7260.pdf?sfvrsn=example",
    "course_description": "MS7260: Crystal Chemistry and Structure explores the fundamental principles of crystallography and their applications in materials design. Students learn to analyze crystal structures and predict material properties.\nKey characteristics include:\nDatabase Skills: Training in crystallographic databases and CIF interpretation.\nStructure Prediction: Understanding structure-property relationships.\nAdvanced Concepts: Nonstoichiometric materials and structural adaptations.\nAssessment: Database projects and structural analysis reports.\nMethodology: Lectures, database workshops, and structural analysis projects.",
    "relevance": 4.3,
    "difficulty": 4.2,
    "# of semesters": "5",
    "Theme 1": "Crystallography",
    "Theme 2": "Materials Fundamentals",
    "Theme 3": "",
    "keywords": "crystal chemistry, crystallography, structural analysis, materials design",
    "top_topic_1": "crystal structures",
    "top_topic_2": "structural analysis",
    "top_topic_3": "materials design",
    "top_topic_1_contribution": 0.9950,
    "top_topic_2_contribution": 0.9940,
    "top_topic_3_contribution": 0.9930
  },
  {
    "": 10,
    "course": "MS7270",
    "course_name": "Nanomaterials and Nanotechnology",
    "course_summary": "The aim of this course is to provide comprehensive knowledge of nanomaterials and their applications.\n\nAt the end of this course the students will:\n\n• Explain how size affects the properties of materials.\n\n• Given a type of nanomaterial, recommend appropriate preparation methods.\n\n• Given a problem, propose appropriate nanomaterial solutions.\n\nPre-requisites: None",
    "course_url": "https://www.ntu.edu.sg/docs/librariesprovider121/mse-postgraduates/mse-pg-coursesummary/ms7270.pdf?sfvrsn=example",
    "course_description": "MS7270: Nanomaterials and Nanotechnology covers the fundamental principles and applications of materials at the nanoscale. Students learn about size effects and nanomaterial synthesis.\nKey characteristics include:\nSize Effects: Understanding how material properties change at the nanoscale.\nSynthesis Methods: Training in nanomaterial preparation techniques.\nProblem Solving: Applying nanomaterials to real-world challenges.\nAssessment: Nanomaterial synthesis projects and problem-solving assignments.\nMethodology: Lectures, laboratory work, and case study analysis.",
    "relevance": 4.7,
    "difficulty": 3.9,
    "# of semesters": "4",
    "Theme 1": "Nanotechnology",
    "Theme 2": "Materials Fundamentals",
    "Theme 3": "",
    "keywords": "nanomaterials, nanotechnology, size effects, nanomaterial synthesis",
    "top_topic_1": "nanoscale properties",
    "top_topic_2": "synthesis methods",
    "top_topic_3": "applications",
    "top_topic_1_contribution": 0.9950,
    "top_topic_2_contribution": 0.9940,
    "top_topic_3_contribution": 0.9930
  },
  {
    "": 11,
    "course": "MS7280",
    "course_name": "Electronic Materials and Devices",
    "course_summary": "The aim of this course is to provide comprehensive understanding of electronic materials and their applications in modern technology.\n\nAt the end of this course the students will be able to:\n\n• Understand and explain the basic properties of electronic materials and their roles in modern technological applications.\n\n• Understand and explain the fundamental principles underlying the operation of various electronic devices.\n\n• Describe the processing of electronic devices and their integration into systems.\n\n• Analyze and predict future directions in the use of electronic materials and the design of electronic devices.\n\nPre-requisites: None",
    "course_url": "https://www.ntu.edu.sg/docs/librariesprovider121/mse-postgraduates/mse-pg-coursesummary/ms7280.pdf?sfvrsn=example",
    "course_description": "MS7280: Electronic Materials and Devices covers the fundamental principles of electronic materials and their applications in modern technology. Students learn about device operation and future trends.\nKey characteristics include:\nDevice Principles: Understanding electronic device operation.\nProcessing Technology: Training in device fabrication and integration.\nFuture Trends: Analysis of emerging electronic materials and devices.\nAssessment: Device design projects and trend analysis reports.\nMethodology: Lectures, laboratory work, and technology forecasting projects.",
    "relevance": 4.8,
    "difficulty": 4.1,
    "# of semesters": "5",
    "Theme 1": "Electronics",
    "Theme 2": "Materials Fundamentals",
    "Theme 3": "",
    "keywords": "electronic materials, electronic devices, device processing, technology trends",
    "top_topic_1": "electronic properties",
    "top_topic_2": "device operation",
    "top_topic_3": "future trends",
    "top_topic_1_contribution": 0.9950,
    "top_topic_2_contribution": 0.9940,
    "top_topic_3_contribution": 0.9930
  },
  {
    "": 12,
    "course": "MS7290",
    "course_name": "Sustainable Materials and Green Technology",
    "course_summary": "The course aims to:\n\n• Achieve full awareness of the sustainability aspects of materials, including examining existing materials and their recycling methods, as well as redesigning materials at the formulation and molecular levels.\n\n• Be taken by PhD and MEng students in Materials Science and Engineering, as well as MSc students in Materials Science and Engineering, who have a vested interest in the sustainability of polymer materials.\n\n• Prepare professionals in materials to consider sustainability aspects, whether by facilitating recycling or replacing materials with more sustainable alternatives. This course is very useful for a future career in materials, whether in research or industry.\n\nPre-requisites: None",
    "course_url": "https://www.ntu.edu.sg/docs/librariesprovider121/mse-postgraduates/mse-pg-coursesummary/ms7290.pdf?sfvrsn=example",
    "course_description": "MS7290: Sustainable Materials and Green Technology focuses on environmentally friendly materials and sustainable manufacturing processes. The course addresses the growing need for sustainable materials in modern industry.\nKey characteristics include:\nSustainability Focus: Emphasis on environmentally friendly materials.\nRecycling Methods: Training in material recycling and reuse techniques.\nGreen Technology: Understanding sustainable manufacturing processes.\nAssessment: Sustainability projects and green technology reports.\nMethodology: Lectures, case studies, and sustainability assessment projects.",
    "relevance": 4.9,
    "difficulty": 3.6,
    "# of semesters": "4",
    "Theme 1": "Healthcare",
    "Theme 2": "Materials Fundamentals",
    "Theme 3": "",
    "keywords": "sustainable materials, green technology, recycling, environmental impact",
    "top_topic_1": "sustainability",
    "top_topic_2": "recycling methods",
    "top_topic_3": "green technology",
    "top_topic_1_contribution": 0.9950,
    "top_topic_2_contribution": 0.9940,
    "top_topic_3_contribution": 0.9930
  },
  {
    "": 13,
    "course": "MS7300",
    "course_name": "Biomaterials and Medical Devices",
    "course_summary": "The aim of this course is to provide comprehensive understanding of biomaterials and their applications in medical devices.\n\nAt the end of this course the students will be able to:\n\n• Understand the fundamental principles of biomaterials science and engineering.\n\n• Design and evaluate biomaterials for specific medical applications.\n\n• Analyze the interaction between biomaterials and biological systems.\n\n• Evaluate the performance and safety of medical devices.\n\n• Apply regulatory requirements for medical device development.\n\nPre-requisites: None",
    "course_url": "https://www.ntu.edu.sg/docs/librariesprovider121/mse-postgraduates/mse-pg-coursesummary/ms7300.pdf?sfvrsn=example",
    "course_description": "MS7300: Biomaterials and Medical Devices covers the interdisciplinary field of materials science and biomedical engineering. Students learn about biocompatible materials and their applications in healthcare.\nKey characteristics include:\nBiocompatibility: Understanding material-biological system interactions.\nMedical Applications: Focus on healthcare and medical device development.\nRegulatory Compliance: Training in medical device regulations and standards.\nAssessment: Medical device design projects and regulatory compliance reports.\nMethodology: Lectures, laboratory work, and case study analysis.",
    "relevance": 4.7,
    "difficulty": 3.9,
    "# of semesters": "5",
    "Theme 1": "Healthcare",
    "Theme 2": "Materials Fundamentals",
    "Theme 3": "",
    "keywords": "biomaterials, medical devices, biocompatibility, healthcare applications",
    "top_topic_1": "biocompatibility",
    "top_topic_2": "medical applications",
    "top_topic_3": "regulatory compliance",
    "top_topic_1_contribution": 0.9950,
    "top_topic_2_contribution": 0.9940,
    "top_topic_3_contribution": 0.9930
  },
  {
    "": 14,
    "course": "MS7310",
    "course_name": "Advanced Materials Processing",
    "course_summary": "The aim of this course is to provide advanced knowledge of materials processing techniques and their applications.\n\nAt the end of this course the students will be able to:\n\n• Understand advanced processing techniques for complex materials.\n\n• Analyze the relationship between processing parameters and material properties.\n\n• Design processing routes for novel materials and applications.\n\n• Evaluate the scalability and economic feasibility of processing methods.\n\n• Apply advanced characterization techniques to process optimization.\n\nPre-requisites: None",
    "course_url": "https://www.ntu.edu.sg/docs/librariesprovider121/mse-postgraduates/mse-pg-coursesummary/ms7310.pdf?sfvrsn=example",
    "course_description": "MS7310: Advanced Materials Processing focuses on cutting-edge processing techniques and their industrial applications. Students learn about novel processing methods and their optimization.\nKey characteristics include:\nAdvanced Techniques: Latest processing methods and technologies.\nProcess Optimization: Training in parameter optimization and control.\nIndustrial Applications: Real-world applications in manufacturing.\nAssessment: Processing optimization projects and industrial case studies.\nMethodology: Lectures, laboratory work, and industrial visits.",
    "relevance": 4.4,
    "difficulty": 4.0,
    "# of semesters": "4",
    "Theme 1": "Industrial materials",
    "Theme 2": "Materials Fundamentals",
    "Theme 3": "",
    "keywords": "advanced processing, process optimization, industrial applications, manufacturing",
    "top_topic_1": "processing techniques",
    "top_topic_2": "process optimization",
    "top_topic_3": "industrial applications",
    "top_topic_1_contribution": 0.9950,
    "top_topic_2_contribution": 0.9940,
    "top_topic_3_contribution": 0.9930
  },
  {
    "": 15,
    "course": "MS7320",
    "course_name": "Materials for Energy Applications",
    "course_summary": "The aim of this course is to provide comprehensive understanding of materials used in energy generation, storage, and conversion.\n\nAt the end of this course the students will be able to:\n\n• Understand the fundamental principles of energy materials science.\n\n• Analyze the performance of materials in energy applications.\n\n• Design materials for specific energy conversion and storage systems.\n\n• Evaluate the sustainability and environmental impact of energy materials.\n\n• Apply materials science principles to renewable energy technologies.\n\nPre-requisites: None",
    "course_url": "https://www.ntu.edu.sg/docs/librariesprovider121/mse-postgraduates/mse-pg-coursesummary/ms7320.pdf?sfvrsn=example",
    "course_description": "MS7320: Materials for Energy Applications covers the critical role of materials in modern energy systems. Students learn about materials for solar cells, batteries, fuel cells, and other energy technologies.\nKey characteristics include:\nEnergy Focus: Specialized knowledge of energy-related materials.\nRenewable Technologies: Focus on sustainable energy solutions.\nPerformance Analysis: Training in energy material evaluation.\nAssessment: Energy material design projects and sustainability reports.\nMethodology: Lectures, laboratory work, and renewable energy case studies.",
    "relevance": 4.8,
    "difficulty": 3.8,
    "# of semesters": "5",
    "Theme 1": "Materials Fundamentals",
    "Theme 2": "Industrial materials",
    "Theme 3": "",
    "keywords": "energy materials, renewable energy, energy storage, sustainability",
    "top_topic_1": "energy conversion",
    "top_topic_2": "energy storage",
    "top_topic_3": "renewable technologies",
    "top_topic_1_contribution": 0.9950,
    "top_topic_2_contribution": 0.9940,
    "top_topic_3_contribution": 0.9930
  },
  {
    "": 16,
    "course": "MS7330",
    "course_name": "Smart Materials and Systems",
    "course_summary": "The aim of this course is to provide understanding of intelligent materials that respond to external stimuli and their applications in smart systems.\n\nAt the end of this course the students will be able to:\n\n• Understand the fundamental principles of smart materials behavior.\n\n• Analyze the response mechanisms of various smart materials.\n\n• Design smart material systems for specific applications.\n\n• Evaluate the performance and reliability of smart systems.\n\n• Apply smart materials in emerging technologies and applications.\n\nPre-requisites: None",
    "course_url": "https://www.ntu.edu.sg/docs/librariesprovider121/mse-postgraduates/mse-pg-coursesummary/ms7330.pdf?sfvrsn=example",
    "course_description": "MS7330: Smart Materials and Systems explores the fascinating world of materials that can sense, respond, and adapt to their environment. Students learn about shape memory alloys, piezoelectric materials, and other intelligent materials.\nKey characteristics include:\nIntelligent Behavior: Understanding stimulus-responsive materials.\nSystem Integration: Training in smart system design and control.\nEmerging Applications: Focus on cutting-edge technologies.\nAssessment: Smart system design projects and performance evaluation reports.\nMethodology: Lectures, laboratory work, and smart technology demonstrations.",
    "relevance": 4.6,
    "difficulty": 4.1,
    "# of semesters": "4",
    "Theme 1": "Materials Fundamentals",
    "Theme 2": "Electronics",
    "Theme 3": "",
    "keywords": "smart materials, intelligent systems, stimulus response, emerging technologies",
    "top_topic_1": "stimulus response",
    "top_topic_2": "system design",
    "top_topic_3": "emerging applications",
    "top_topic_1_contribution": 0.9950,
    "top_topic_2_contribution": 0.9940,
    "top_topic_3_contribution": 0.9930
  },
  {
    "": 17,
    "course": "MS7340",
    "course_name": "Materials for Aerospace Applications",
    "course_summary": "The aim of this course is to provide specialized knowledge of materials used in aerospace engineering and their unique requirements.\n\nAt the end of this course the students will be able to:\n\n• Understand the specific requirements of aerospace materials.\n\n• Analyze the performance of materials under extreme aerospace conditions.\n\n• Design materials for lightweight and high-strength aerospace applications.\n\n• Evaluate the reliability and safety of aerospace materials.\n\n• Apply advanced materials science to aerospace engineering challenges.\n\nPre-requisites: None",
    "course_url": "https://www.ntu.edu.sg/docs/librariesprovider121/mse-postgraduates/mse-pg-coursesummary/ms7340.pdf?sfvrsn=example",
    "course_description": "MS7340: Materials for Aerospace Applications covers the critical role of materials in modern aerospace engineering. Students learn about high-performance materials for aircraft, spacecraft, and aerospace systems.\nKey characteristics include:\nAerospace Focus: Specialized knowledge of aerospace material requirements.\nExtreme Conditions: Understanding material behavior under aerospace stresses.\nSafety and Reliability: Focus on aerospace material standards and testing.\nAssessment: Aerospace material design projects and safety evaluation reports.\nMethodology: Lectures, laboratory work, and aerospace industry case studies.",
    "relevance": 4.5,
    "difficulty": 4.2,
    "# of semesters": "5",
    "Theme 1": "Industrial materials",
    "Theme 2": "Materials Fundamentals",
    "Theme 3": "",
    "keywords": "aerospace materials, high-performance materials, lightweight materials, safety standards",
    "top_topic_1": "aerospace requirements",
    "top_topic_2": "performance under stress",
    "top_topic_3": "safety standards",
    "top_topic_1_contribution": 0.9950,
    "top_topic_2_contribution": 0.9940,
    "top_topic_3_contribution": 0.9930
  }
]